Revit 2027 API
ParameterTypeId.PathReinEndHookOrient1Wall Property
 "Primary Bar - End Hook Orientation"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PathReinEndHookOrient1Wall { get; }
Public Shared ReadOnly Property PathReinEndHookOrient1Wall As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PathReinEndHookOrient1Wall {
	ForgeTypeId^ get ();
}
static member PathReinEndHookOrient1Wall : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace